# Análisis de datos con `pandas`: ejercicios

**NOTAS**
 - Hay muchas formas de resolver cada problema, encuentra la tuya.
 - Crea las celdas extra que necesites.
 - Recuerda que una celda puede ser de tipo Código, o de tipo Markdown. Utiliza las segundas para escribir texto y explicaciones si lo precisas.
 - Intenta crear variables a la hora de resolver los ejercicios.
 - Puedes apoyarte en internet: todos los programadores lo hacemos a diario.

<img width=500 src="https://upload.wikimedia.org/wikipedia/commons/3/31/TitanicBeken.jpg">

Importamos el csv del titanic a un dataframe

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("./datasets/titanic.csv")

Echa un vistazo a las primeras filas del dataframe

In [4]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [5]:
df.tail()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1304,"Strilic, Mr. Ivan",male,27.0,3,0,0,315083,8.6625,NaN,S,0
1305,"Bengtsson, Mr. John Viktor",male,26.0,3,0,0,347068,7.7750,NaN,S,0
1306,"Gustafsson, Mr. Karl Gideon",male,19.0,3,0,0,347069,7.7750,NaN,S,0
1307,"Gustafsson, Mr. Anders Vilhelm",male,37.0,3,2,0,3101276,7.9250,NaN,S,0
1308,"McDermott, Miss. Brigdet Delia",female,NaN,3,0,0,330932,7.7875,NaN,Q,1

In [9]:
df.sample(5)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1080,"Strom, Mrs. Wilhelm",female,29.0,3,1,1,347054,10.4625,G6,S,0
648,"Guest, Mr. Robert",male,NaN,3,0,0,376563,8.0500,NaN,S,0
1156,"Porter, Mr. Walter Chamberlain",male,47.0,1,0,0,110465,52.0000,C110,S,0
589,"Walker, Mr. William Anderson",male,47.0,1,0,0,36967,34.0208,D46,S,0
140,"Spedden, Mr. Frederic Oakley",male,45.0,1,1,1,16966,134.5000,E34,C,1

Cuántos pasajeros hay en este dataframe?

In [10]:
df.shape

(1309, 11)

In [11]:
type(df.shape)

tuple

In [16]:
df.shape[0]

1309

In [20]:
print(f"El número de pasajeros es {df.shape[0]} en el titanic")

El número de pasajeros es 1309 en el titanic

Cuáles son las columnas del dataframe?

In [24]:
df.columns

Index(['Name', 'Sex', 'Age', 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

Cuál es la edad media de los pasajeros? Y la mediana? Cómo interpretas el resultado?

In [31]:
df.Age.mean().round(2)

29.88

Cuánto costó el billete más caro?

In [34]:
df.Fare.max()

512.3292

Cuánto pagaron entre todos los pasajeros?

In [35]:
df.Fare.sum()

43550.4869

Filtra el dataframe para ver sólo a las mujeres

In [39]:
df[df.Sex == "female"].head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1
5,"Douglas, Mrs. Frederick Charles",female,27.0,1,1,1,PC 17558,247.5208,B58 B60,C,1

Filtra el dataframe para ver sólo a los niños (menores de 15 años)

In [40]:
df[df.Age < 15].head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
9,"Watt, Miss. Bertha J",female,12.0,2,0,0,C.A. 33595,15.750,NaN,S,1
10,"Skoog, Miss. Mabel",female,9.0,3,3,2,347088,27.900,NaN,S,0
35,"Sweet, Mr. George Frederick",male,14.0,2,0,0,220845,65.000,NaN,S,0
44,"Ryerson, Master. John Borie",male,13.0,1,2,2,PC 17608,262.375,B57 B59 B63 B66,C,1
72,"Coutts, Master. William Loch ""William""",male,3.0,3,1,1,C.A. 37671,15.900,NaN,S,1

Filtra el dataframe para ver sólo a mujeres y niños

In [45]:
df[(df.Age < 15) | (df.Sex == "female")].head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1
5,"Douglas, Mrs. Frederick Charles",female,27.0,1,1,1,PC 17558,247.5208,B58 B60,C,1

Quién era el pasajero más joven y qué edad tenía?

In [46]:
df.Age.min()

0.17

In [50]:
df[df.Age == df.Age.min()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
151,"Dean, Miss. Elizabeth Gladys Millvina",female,0.17,3,1,2,C.A. 2315,20.575,NaN,S,1

Cuántos pasajeros eran menores de 20? Qué porcentaje?

In [54]:
df[df.Age < 20].shape[0]

225

In [56]:
(df.Age < 20).sum()

225

Cual es el decil 8 de la edad?

In [64]:
df.Age.median()

28.0

In [63]:
df.Age.quantile(0.80)

42.0

Cuánta gente sobrevivió? Cuánta murió?

In [66]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [67]:
df.Survived.value_counts()

Survived
0    809
1    500
Name: count, dtype: int64

In [70]:
df.Survived.value_counts()[1]

500

Cuánta gente viajaba en cada clase?

In [68]:
df.Pclass.value_counts()

Pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [73]:
df.Embarked.value_counts()

Embarked
S    914
C    270
Q    123
Name: count, dtype: int64

Era más probable sobrevivir siendo de primera clase?

Era más probable sobrevivir siendo mujer?

Con cuántos familiares viajaba la gente? (informado en la columna SibSp)

Cuántas puertas de embarque había?

Crea un dataframe con las personas que viajaban en primera clase

Crea un dataframe que contenga mujeres y niños

Crea un dataframe con la gente que no viajara en la `S`

Crea un dataframe con todas las "Miss"

Crea una columna booleana que almacene si el pasajero es mayor de edad

Crea una columna con el año de nacimiento del pasajero

Afectó el número de familiares a la probabilidad de sobrevivir?

Eran más caros los billetes de primera clase?

Eran más jovenes los hombres que las mujeres del titanic?

Crea una columna que almacene si el número de ticket del pasajero contiene alguna letra. Define para ello una función y usa `apply`

Exporta los datos a un csv llamado `titanic_enriched.csv`